Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.ec2 has been changed
~ resource "aws_instance" "ec2" {
        id                                   = "i-020b8c82186f3c090"
      + instance_initiated_shutdown_behavior = "stop"
        tags                                 = {
            "Name"                   = "laiello.com"
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all                             = {
          + "Name"                   = "laiello.com"
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (28 unchanged attributes hidden)

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }


      + enclave_options {
          + enabled = false
        }



      ~ root_block_device {
          + tags                  = {}
          + throughput            = 0
            # (8 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }
  # aws_cloudwatch_metric_alarm.disk_usage_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "disk_usage_alarm" {
        id                        = "disk_usage_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }
  # aws_backup_plan.laiello_backup_plan has been changed
~ resource "aws_backup_plan" "laiello_backup_plan" {
        id       = "031d200b-832f-43f8-9587-ba96d49743e3"
        name     = "laiello-wordpress-backup-plan"
        tags     = {}
      + tags_all = {}
        # (2 unchanged attributes hidden)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + recovery_point_tags      = {}
          + rule_name                = "laiello-wordpress-backup-rule"
          + schedule                 = "cron(0 5 ? * 1 *)"
          + start_window             = 60
          + target_vault_name        = "Default"
        }
      - rule {
          - completion_window   = 180 -> null
          - recovery_point_tags = {} -> null
          - rule_name           = "laiello-wordpress-backup-rule" -> null
          - schedule            = "cron(0 5 ? * 1 *)" -> null
          - start_window        = 60 -> null
          - target_vault_name   = "Default" -> null
        }
    }
  # aws_cloudwatch_metric_alarm.network_inbound_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "network_inbound_alarm" {
        id                        = "network_inbound_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.system_status_check_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "system_status_check_alarm" {
        id                        = "system_status_check_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }
  # aws_iam_role.backup_role has been changed
~ resource "aws_iam_role" "backup_role" {
        id                    = "laiello_wordpress_backup_role"
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup",
        ]
        name                  = "laiello_wordpress_backup_role"
        tags                  = {
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all              = {
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (7 unchanged attributes hidden)

      + inline_policy {}
    }
  # aws_cloudwatch_metric_alarm.cpu_utilization_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "cpu_utilization_alarm" {
        id                        = "cpu_utilization_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }
  # aws_security_group.wordpress has been changed
~ resource "aws_security_group" "wordpress" {
        id                     = "sg-0b023d766e2168eca"
        name                   = "wordpress"
        tags                   = {
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all               = {
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (7 unchanged attributes hidden)
    }
  # aws_network_interface.eni has been changed
~ resource "aws_network_interface" "eni" {
        id                 = "eni-071720edd47fe416b"
      + interface_type     = "interface"
        tags               = {
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all           = {
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (10 unchanged attributes hidden)

      + attachment {
          + attachment_id = "eni-attach-038249a25269679d8"
          + device_index  = 0
          + instance      = "i-020b8c82186f3c090"
        }
    }
  # aws_iam_instance_profile.laiello_instance_profile has been changed
~ resource "aws_iam_instance_profile" "laiello_instance_profile" {
        id          = "laiello_wordpress_instance_profile"
        name        = "laiello_wordpress_instance_profile"
      + tags        = {}
      + tags_all    = {}
        # (5 unchanged attributes hidden)
    }
  # aws_eip.one has been changed
~ resource "aws_eip" "one" {
        id                   = "eipalloc-0d6cfba176c247ced"
      + instance             = "i-020b8c82186f3c090"
        tags                 = {
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all             = {
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (10 unchanged attributes hidden)
    }
  # aws_sns_topic.laiello_infrastructure has been changed
~ resource "aws_sns_topic" "laiello_infrastructure" {
      + content_based_deduplication = false
      + fifo_topic                  = false
        id                          = "arn:aws:sns:us-east-1:385445628596:laiello-wordpress"
        name                        = "laiello-wordpress"
      + owner                       = "385445628596"
        tags                        = {
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all                    = {
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (2 unchanged attributes hidden)
    }
  # aws_iam_role.laiello_ec2_role has been changed
~ resource "aws_iam_role" "laiello_ec2_role" {
        id                    = "laiello_wordpress_ec2_role"
      + managed_policy_arns   = [
          + "arn:aws:iam::385445628596:policy/S3",
          + "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
          + "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          + "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ]
        name                  = "laiello_wordpress_ec2_role"
        tags                  = {
            "environment"            = "prod"
            "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
            "terraform_version"      = "0.15.4"
            "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
      + tags_all              = {
          + "environment"            = "prod"
          + "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform"
          + "terraform_version"      = "0.15.4"
          + "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6"
        }
        # (7 unchanged attributes hidden)

      + inline_policy {}
    }
  # aws_cloudwatch_metric_alarm.memory_usage_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "memory_usage_alarm" {
        id                        = "memory_usage_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.cpu_credit_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "cpu_credit_alarm" {
        id                        = "cpu_credit_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }
  # aws_cloudwatch_log_group.log_group has been changed
~ resource "aws_cloudwatch_log_group" "log_group" {
        id                = "laiello.com-wordpress"
        name              = "laiello.com-wordpress"
        tags              = {}
      + tags_all          = {}
        # (2 unchanged attributes hidden)
    }
  # aws_cloudwatch_metric_alarm.instance_status_check_alarm has been changed
~ resource "aws_cloudwatch_metric_alarm" "instance_status_check_alarm" {
        id                        = "instance_status_check_alarm"
        tags                      = {}
      + tags_all                  = {}
        # (17 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_ebs_volume.ebs_volume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ebs_volume" "ebs_volume"  {
      ~ arn                  = "arn:aws:ec2:us-east-1:385445628596:volume/vol-05703bad40231ef4d" -> (known after apply)
      ~ availability_zone    = "us-east-1a" -> (known after apply)
      ~ encrypted            = true -> (known after apply)
      ~ id                   = "vol-05703bad40231ef4d" -> (known after apply)
      ~ iops                 = 300 -> (known after apply)
      ~ kms_key_id           = "arn:aws:kms:us-east-1:385445628596:key/eed60844-fcf9-4f9b-9d27-081218b08e71" -> (known after apply)
      ~ multi_attach_enabled = false -> (known after apply)
      + outpost_arn          = (known after apply)
      ~ size                 = 100 -> (known after apply)
      ~ snapshot_id          = "snap-0c48b11bc23789ae7" -> (known after apply)
      ~ tags                 = {
          + "environment"           = "prod"
          + "terraform_deployed_by" = "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
        }
      + throughput           = (known after apply)
      ~ volume_id            = "vol-05703bad40231ef4d" -> (known after apply)
      ~ volume_type          = "gp2" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_backup_selection.laiello_backup_selection must be replaced
-/+ resource "aws_backup_selection" "laiello_backup_selection" {
      ~ id           = "2cee3659-0378-4a5b-9352-db08a7dffc65" -> (known after apply)
        name         = "laiello-wordpress-backup-selection"
      ~ resources    = [
          - "arn:aws:ec2:us-east-1:385445628596:volume/vol-05703bad40231ef4d",
        ] -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_eip.one will be updated in-place
~ resource "aws_eip" "one" {
        id                   = "eipalloc-0d6cfba176c247ced"
      ~ tags                 = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.backup_role will be updated in-place
~ resource "aws_iam_role" "backup_role" {
        id                    = "laiello_wordpress_backup_role"
        name                  = "laiello_wordpress_backup_role"
      ~ tags                  = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.laiello_ec2_role will be updated in-place
~ resource "aws_iam_role" "laiello_ec2_role" {
        id                    = "laiello_wordpress_ec2_role"
        name                  = "laiello_wordpress_ec2_role"
      ~ tags                  = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_instance.ec2 will be updated in-place
~ resource "aws_instance" "ec2" {
        id                                   = "i-020b8c82186f3c090"
      ~ tags                                 = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (2 unchanged elements hidden)
        }
        # (29 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # aws_network_interface.eni will be updated in-place
~ resource "aws_network_interface" "eni" {
        id                 = "eni-071720edd47fe416b"
      ~ tags               = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all           = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.wordpress will be updated in-place
~ resource "aws_security_group" "wordpress" {
        id                     = "sg-0b023d766e2168eca"
        name                   = "wordpress"
      ~ tags                   = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sns_topic.laiello_infrastructure will be updated in-place
~ resource "aws_sns_topic" "laiello_infrastructure" {
        id                          = "arn:aws:sns:us-east-1:385445628596:laiello-wordpress"
        name                        = "laiello-wordpress"
      ~ tags                        = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                    = {
          ~ "terraform_deployed_by"  = "arn:aws:iam::385445628596:user/terraform" -> "arn:aws:sts::385445628596:assumed-role/atlantis/1625021073624968977"
          - "terraform_version"      = "0.15.4" -> null
          - "terraform_workspace_id" = "ws-ctRBPZYosCwH6RL6" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.2w.laiello.com/lock?id=aiell0%252Flaiello.com%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 7 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
